import 'package:flutter/material.dart';
import 'package:peshangapplication/components/CustomDrawer.dart';

class twana extends StatefulWidget {
  const twana({ Key? key }) : super(key: key);

  @override
  State<twana> createState() => _twanaState();
}

class _twanaState extends State<twana> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: null,
      endDrawer: CustomDrawer(),
      body: ListView(
        children: [
        Container(
          margin: EdgeInsets.only(top: 20),
          child:
           Text("ئەو توانایانەی کە بۆ خوێندنی زانستە کارگێڕیەکان گرینگن",textAlign: TextAlign.right,style: TextStyle(fontFamily: "kurdish",fontSize: 30),)),
          Padding(
            padding: const EdgeInsets.all(8.0),
            child: Directionality(
              textDirection: TextDirection.rtl,
              child: Text("هونه ری په یوه ندی: وەك توانای مامه له کردن له گه ل خه لكیدروستكردنی په یوه ندیی نوئ و سه ركه وتوو، كاركردنی هه ره وه زی، ئه مه دیدگا و ریگایه کی گه وره ده كاته وه بؤخویندکاری ئه م بواره له سه ر ئاستی تاکی و پیشه یی . هاندان: نه مه له ریگه ی توانای سه ركرده كاته وه يه بؤ په يوه ندیدروستكردن له گه ل كارمه نده كان به شیوه یه کی زاروكی و كیتابی، توانای هاندان و پالنانه، هه روه ها دەستكه وتنى لايه نگریی کارمونده كانه بؤ كاره كه یان، نه عاش له و رووه وه که سه ركه وتن له کاردا ته نها له گرنگیدان به بواره بازرگانييه كه دا نييه به لكو به تیشک خستنه سه ر پالپشتیكردنی كارمه نده كان و زیادکردنیکارایی و به رهه مدارییان لایه كی گرنگ پر ده كريته وه • ریكخستن: ده بيت هونه ره کانی ریكخستن و سه رپه رشتی كار وباستنی كؤبوونه وه و بستنی ناوه ندی راهینان بزانریت، له به ر نه وهی که نه بوونی ریكخستن و هه ره مه كی بوون ده بيته هؤىشكست خواردن له کاری به ریوه بردندا : پلاندانان و بیرکردنه وه ی ستراتیژی: ده بیت پلان بؤ داهاتووی كاردابنریت، بؤ گه رانتی کردنی ئامانجه جؤراوجؤره كان، ئه مه ش له رنگه ی دیاریكردنی كاره گرنگتره كانه وه و جنبه جیكردنی نه وهی که له پیشه وه يه و پاشان دواتر، هه روه ها پیداچوونه وه بوسه ر ریكخستن و سیاسه ته كان و ئه نجامدانی كار به پییان، بیرکردنه وه ی ستراتیژیش خؤى ده بينيته وه له پیشنیازكردنی بیرؤکه داهينه ر ونوییه کان که کاره كه ی یی جیاواز ده بيت له هه ر کاریکی تر • فراوانبینیی بازرگانی له ریگه ی زانینیکی ته واوه تی ده رباره ی بازارکه یه كیكه له تواناييه زؤر گرنگه كان بؤ خاوان كاره كان، به لأم به داخه وه زؤربه ی ده رچووه تازه کانی نیست زانیارییان له سه ر نه مبواره نییه : بریاردان: واته توانای بریاردانی توندوتؤل له كاتی گونجاودا به بیتران و دوودلیی، ته مه زیان و زه ره ره كان كه م ده كاته وههه روه ها ده بيته هؤى قوستنه وه ی هه له به رده سته كان. • تیگه یشتن له ريكخراو: واته تنگه یشتنی ته واو ده رباره ی په بانیریكخراو و ئامانج و بنه عاكانی و دیدگای، وه باشان جيبه جیكردنی كاره كان به پیی نه م سياساته و به شيوه يه ک پیچه وانه ی نه بیتسه ركه وتن له بواری کاری به ریوه بردندا ته نها به دوستكه وتنی تواناییه کانی به ریوه بردن نابیت. به لكو ده بيت كه سی پسپؤړ چه ندین هونه ری دیكه ی هه بیت که يارمه تيدوری بن له جيبه جیكردنی ته و لايه نه تیوریانه ی که له كاتی خویندنی ئه كادیمی وه ریگرتووه. بؤ ده ستكه وتنی له م هونه ر و تواناییانه ش ده بیت به شداری له خوله کانی راهينان و شوینه کانی کارکردن بكات",
              style: TextStyle(fontFamily: "kurdish",fontSize: 20),),
            ),
          )
        ],
      ),
    );
  }
}